app/controllers/kebabs_controller.rb

SELECT * FROM "kebabs"
---
  def index
    @kebabs = Kebab.all(:order => 'date asc')

SELECT * FROM "kebabs" WHERE ("kebabs"."id" = 1)
---
  def show
    @kebab = Kebab.find(params[:id])

INSERT INTO "transportations" ("created_at", "updated_at", "person_id", "kebab_id") VALUES('2010-01-20 18:10:13', '2010-01-20 18:10:13', NULL, NULL)
---
  def new
    @kebab = Kebab.new
    @kebab.build_promoter
    @kebab.transportations << Transportation.new

SELECT * FROM "kebabs" WHERE ("kebabs"."id" = 1)
---
  def edit
    @kebab = Kebab.find(params[:id])

INSERT INTO "kebabs" ("comment", "created_at", "updated_at", "date", "promoter_id") VALUES('test', '2010-01-20 18:01:58', '2010-01-20 18:01:58', '2010-01-20', 1)
---
  def create
    @kebab = Kebab.new(params[:kebab])

    respond_to do |format|
      if @kebab.save

SELECT * FROM "kebabs" WHERE ("kebabs"."id" = 4)
UPDATE "kebabs" SET "updated_at" = '2010-01-21 18:27:29', "comment" = 'dfdfdfddffd' WHERE "id" = 10
---
  def update
    @kebab = Kebab.find(params[:id])

    respond_to do |format|
      if @kebab.update_attributes(params[:kebab])

SELECT * FROM "kebabs" WHERE ("kebabs"."id" = 9)
DELETE FROM "kebabs" WHERE "id" = 9
---
  def destroy
    @kebab = Kebab.find(params[:id])
    @kebab.destroy