app/controllers/statistics_controller.rb

  def index
    kebab_all = Kebab.all(:order => 'date asc')

    # Nombre de participants par semaine
    by_week = kebab_all.collect {|k|  [k.date.cweek, k.participations.count]}
    @weeks = by_week.collect {|bw| bw[0]}
    @participations = by_week.collect {|bw| bw[1]}
    @average = @participations.inject(0.0) { |sum,el| sum + el } / @participations.size
    @x_axis = (0..@participations.max).to_a

    # Les chauffeurs
    @all_transportations = kebab_all.collect{|k| k.transportations}.flatten # build an array of all transportations
---
SELECT * FROM "kebabs"
SELECT count(*) AS count_all FROM "participations" WHERE ("participations".kebab_id = 1)
SELECT * FROM "transportations" WHERE ("transportations".kebab_id = 1)